Public Attributes | List of all members
API_RailingRailType Struct Reference
Element Manager API
Represents a Rail element. More...
#include <APIdefs_Elements.h>
 Public Attributes
API_Elem_Head  | head
General element header.
API_Guid  | owner
GUID of the Railing Segment element owning this Rail.
API_Guid  | symbID
The identifier of the symbol of this element.
bool  | visible
True, if the Rail is visible.
bool  | relative
True, if the Rail is relative.
double  | horizontalOffset
The horizontal offset of the Rail from the Segment.
double  | height
The height of the Rail element.
Detailed Description
Represents a Rail element.
Member Data Documentation
◆ head
 API_RailingRailType::head
General element header.
◆ height
 API_RailingRailType::height
The height of the Rail element.
◆ horizontalOffset
 API_RailingRailType::horizontalOffset
The horizontal offset of the Rail from the Segment.
◆ owner
 API_RailingRailType::owner
GUID of the Railing Segment element owning this Rail.
◆ relative
 API_RailingRailType::relative
True, if the Rail is relative.
◆ symbID
 API_RailingRailType::symbID
The identifier of the symbol of this element.
◆ visible
 API_RailingRailType::visible
True, if the Rail is visible.